#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <math.h>
#include "set.h"
#include "cntl.h"

void cntl(void)
{

  printf( "»î»»ÈÖ¹æ¡Ê£´·å¡Ë¤òÆþÎÏ¤·¤Æ¤¯¤À¤µ¤¤\n" ) ; 
  scanf( "%d%*c", &BANGO ) ;
  if ( ( BANGO < 1000 ) || ( BANGO > 9999 ) ) {
    fprintf( stderr, "»î»»ÈÖ¹æ¤¬£´·å¤Ç¤Ï¤¢¤ê¤Þ¤»¤ó¡Ê¥¨¥é¡¼¡Ë\n" ) ;
    printf( "BANGO=%d\n", BANGO ) ;
    exit(2) ;
  }
  printf( "»î»»ÈÖ¹æ¤Ï %d ¤ËÀßÄê¤µ¤ì¤Þ¤·¤¿\n", BANGO ) ;
 
  printf( "Å¬ÍÑ³ÈÂç¤ÎÍ­Ìµ¤ÎÀßÄê\n" ) ; 
  printf( "£°¡§Å¬ÍÑ³ÈÂç¤Ê¤·¡Ê¸½¹ÔÀ©ÅÙ¡Ë\n" ) ; 
  printf( "£±¡§Å¬ÍÑ³ÈÂç­¡  90Ëü¿Í¥Ù¡¼¥¹¡Ê´ë¶Èµ¬ÌÏÍ×·ïÅ±ÇÑ¡Ü¸Ä¿Í£µ¿Í°Ê¾åÈóÅ¬ÍÑ¶È¼ï²ò¾Ã¡Ë\n" ) ; 
  printf( "£²¡§Å¬ÍÑ³ÈÂç­¢ 200Ëü¿Í¥Ù¡¼¥¹¡Ê­¡¤Ë²Ã¤¨¡¢ÄÂ¶âÍ×·ïÅ±ÇÑ¡Ë\n" ) ; 
  printf( "£³¡§Å¬ÍÑ³ÈÂç­£ 270Ëü¿Í¥Ù¡¼¥¹¡Ê­¢¤Ë²Ã¤¨¡¢¸Ä¿Í£µ¿ÍÌ¤Ëþ¡Ë\n" ) ; 
  printf( "£´¡§Å¬ÍÑ³ÈÂç­¤ 860Ëü¿Í¥Ù¡¼¥¹¡Ê½µ10»þ´Ö°Ê¾å¤ÎÁ´¤Æ¤Î¸ÛÍÑ¼Ô¡Ë\n" ) ; 
  printf( "£µ¡§ºÇÄãÄÂ¶â¤¬2030Ç¯ÂåÈ¾¤Ð¤Ë1500±ß¤È¤Ê¤Ã¤¿¾ì¹ç\n" ) ; 

  PART = 0 ;
  PARTYR1 = ENDY + 1 ;
  PARTYR2 = ENDY + 1 ;
  PARTKYR = 2023 ;
  
  scanf( "%d%*c", &MODE ) ;
  switch ( MODE ) {
    case 0:
      printf( "Å¬ÍÑ³ÈÂç¤Ê¤· (¸½¹ÔÀ©ÅÙ) ¤ËÀßÄê¤·¤Þ¤·¤¿\n" ) ;
      break ;
    case 1:
      printf( "Å¬ÍÑ³ÈÂç­¡  90Ëü¿Í¥Ù¡¼¥¹¤ËÀßÄê¤·¤Þ¤·¤¿\n" ) ;
      PART = 2 ;
      PARTYR1 = 2027 ;
      PARTYR2 = 2029 ;
      break ;
    case 2:
      printf( "Å¬ÍÑ³ÈÂç­¢ 200Ëü¿Í¥Ù¡¼¥¹¤ËÀßÄê¤·¤Þ¤·¤¿\n" ) ;
      PART = 2 ;
      PARTYR1 = 2027 ;
	  PARTYR2 = 2029 ;
      break ;
    case 3:
      printf( "Å¬ÍÑ³ÈÂç­£ 270Ëü¿Í¥Ù¡¼¥¹¤ËÀßÄê¤·¤Þ¤·¤¿\n" ) ;
      PART = 2 ;
      PARTYR1 = 2027 ;
	  PARTYR2 = 2029 ;
      break ;
    case 4:
      printf( "Å¬ÍÑ³ÈÂç­¤ 860Ëü¿Í¥Ù¡¼¥¹¤ËÀßÄê¤·¤Þ¤·¤¿\n" ) ;
      PART = 2 ;
      PARTYR1 = 2027 ;
      PARTYR2 = 2029 ;
      break ;
    case 5:
      printf( "ºÇÄãÄÂ¶â¤¬2030Ç¯ÂåÈ¾¤Ð¤Ë1500±ß¤ËÀßÄê¤·¤Þ¤·¤¿\n" ) ;
      PART = 2 ;
      PARTYR1 = 2027 ;
      PARTYR2 = 2029 ;
      break ;
    default:
      fprintf( stderr, "ÀßÄê¤¬´Ö°ã¤Ã¤Æ¤¤¤Þ¤¹\n" ) ;
      exit(2);
  }

  printf( "´ðÁÃ£´£µÇ¯²½¤ÎÍ­Ìµ¤ÎÀßÄê\n" ) ; 
  printf( "£°¡§´ðÁÃ£´£°Ç¯ (¸½¹ÔÀ©ÅÙ)\n" ) ; 
  printf( "£±¡§´ðÁÃ£´£µÇ¯\n" ) ;
  
  scanf( "%d%*c", &MODE45 ) ;
  switch ( MODE45 ) {
    case 0:
      printf( "´ðÁÃ£´£°Ç¯ (¸½¹ÔÀ©ÅÙ) ¤ËÀßÄê¤·¤Þ¤·¤¿\n" ) ;
      break ;
    case 1:
      printf( "´ðÁÃ£´£µÇ¯¤ËÀßÄê¤·¤Þ¤·¤¿\n" ) ;
      break ;
    default:
      fprintf( stderr, "ÀßÄê¤¬´Ö°ã¤Ã¤Æ¤¤¤Þ¤¹\n" ) ;
      exit(2) ;
  }

  SJINKOY = 2020 ;
  FJINKOY = 2120 ;
  
  printf( "¿Í¸ý¿ä·× (½ÐÀ¸Î¨) ¤ÎÀßÄê\n" ) ; 
  printf( "£±¡§½ÐÀ¸Ãæ°Ì\n" ) ; 
  printf( "£²¡§½ÐÀ¸¹â°Ì\n" ) ; 
  printf( "£³¡§½ÐÀ¸Äã°Ì\n" ) ; 
  scanf( "%d%*c", &JIN ) ;
  switch ( JIN ) {
    case 1:
      printf( "½ÐÀ¸Ãæ°Ì¤ËÀßÄê¤·¤Þ¤·¤¿\n" ) ;
      break ;
    case 2:
      printf( "½ÐÀ¸¹â°Ì¤ËÀßÄê¤·¤Þ¤·¤¿\n" ) ;
      break ;
    case 3:
      printf( "½ÐÀ¸Äã°Ì¤ËÀßÄê¤·¤Þ¤·¤¿\n" ) ;
      break ;
    default :
      fprintf( stderr, "½ÐÀ¸Î¨¤ÎÀßÄê¤¬´Ö°ã¤Ã¤Æ¤¤¤Þ¤¹\n" ) ;
      exit(2) ;
  }
  
  printf( "¿Í¸ý¿ä·× (»àË´Î¨) ¤ÎÀßÄê\n" ) ; 
  printf( "£±¡§»àË´Ãæ°Ì\n" ) ; 
  printf( "£²¡§»àË´¹â°Ì\n" ) ; 
  printf( "£³¡§»àË´Äã°Ì\n" ) ; 
  scanf( "%d%*c", &QX ) ;
  switch ( QX ) {
    case 1:
      printf( "»àË´Ãæ°Ì¤ËÀßÄê¤·¤Þ¤·¤¿\n" ) ;
      break ;
    case 2:
      printf( "»àË´¹â°Ì¤ËÀßÄê¤·¤Þ¤·¤¿\n" ) ;
      break ;
    case 3:
      printf( "»àË´Äã°Ì¤ËÀßÄê¤·¤Þ¤·¤¿\n" ) ;
      break ;
    default :
      fprintf( stderr, "»àË´Î¨¤ÎÀßÄê¤¬´Ö°ã¤Ã¤Æ¤¤¤Þ¤¹\n" ) ;
      exit(2) ;
  }

  printf( "¿Í¸ý¿ä·× (Æþ¹ñÄ¶²á) ¤ÎÀßÄê\n" ) ; 
  printf( "£°¡§16Ëü¿Í (R5¿ä·×) ¥Ù¡¼¥¹\n" ) ; 
  printf( "£±¡§6.9Ëü¿Í (H29¿ä·×) ¥Ù¡¼¥¹\n" ) ; 
  printf( "£²¡§25Ëü¿Í (H29¿ä·×) ¥Ù¡¼¥¹\n" ) ; 
  scanf( "%d%*c", &NC ) ;
  switch ( NC ) {
    case 0:
      printf( "Æþ¹ñÄ¶²á16Ëü¿Í¤ËÀßÄê¤·¤Þ¤·¤¿\n" ) ;
      break ;
    case 1:
      printf( "Æþ¹ñÄ¶²á6.9Ëü¿Í¤ËÀßÄê¤·¤Þ¤·¤¿\n" ) ;
      break ;
    case 2:
      printf( "Æþ¹ñÄ¶²á25Ëü¿Í¤ËÀßÄê¤·¤Þ¤·¤¿\n" ) ;
      break ;
    default :
      fprintf( stderr, "Æþ¹ñÄ¶²á¤ÎÀßÄê¤¬´Ö°ã¤Ã¤Æ¤¤¤Þ¤¹\n" ) ;
      exit(2) ;
  }
  YUHAIGY = 2070 ;

  printf( "Ï«Æ¯ÎÏÎ¨¤ÎÀßÄê\n" ) ; 
  printf( "£±¡§Ï«Æ¯»²²Ã¿ÊÅ¸¥±¡¼¥¹ (³°¹ñ¿Í16Ëü¿Í)\n" ) ;
  printf( "£²¡§Ï«Æ¯»²²ÃÁ²¿Ê¥±¡¼¥¹ (³°¹ñ¿Í16Ëü¿Í)\n" ) ;
  printf( "£³¡§Ï«Æ¯»²²Ã¸½¾õ¥±¡¼¥¹ (³°¹ñ¿Í16Ëü¿Í)\n" ) ;
  printf( "£´¡§Ï«Æ¯»²²Ã¿ÊÅ¸¥±¡¼¥¹ (³°¹ñ¿Í6.9Ëü¿Í)\n" ) ;
  printf( "£µ¡§Ï«Æ¯»²²ÃÁ²¿Ê¥±¡¼¥¹ (³°¹ñ¿Í6.9Ëü¿Í)\n" ) ;
  printf( "£¶¡§Ï«Æ¯»²²Ã¸½¾õ¥±¡¼¥¹ (³°¹ñ¿Í6.9Ëü¿Í)\n" ) ;
  printf( "£·¡§Ï«Æ¯»²²Ã¿ÊÅ¸¥±¡¼¥¹ (³°¹ñ¿Í25Ëü¿Í)\n" ) ;
  printf( "£¸¡§Ï«Æ¯»²²ÃÁ²¿Ê¥±¡¼¥¹ (³°¹ñ¿Í25Ëü¿Í)\n" ) ;
  printf( "£¹¡§Ï«Æ¯»²²Ã¸½¾õ¥±¡¼¥¹ (³°¹ñ¿Í25Ëü¿Í)\n" ) ;

  scanf( "%d%*c", &ROUDR ) ; 
  switch ( ROUDR ) {
    case 1: 
      printf( "Ï«Æ¯»²²Ã¿ÊÅ¸¥±¡¼¥¹ (³°¹ñ¿Í16Ëü¿Í) ¤ËÀßÄê¤·¤Þ¤·¤¿\n" ) ;
      break ;
    case 2: 
      printf( "Ï«Æ¯»²²ÃÁ²¿Ê¥±¡¼¥¹ (³°¹ñ¿Í16Ëü¿Í) ¤ËÀßÄê¤·¤Þ¤·¤¿\n" ) ;
      break ;
    case 3: 
      printf( "Ï«Æ¯»²²Ã¸½¾õ¥±¡¼¥¹ (³°¹ñ¿Í16Ëü¿Í) ¤ËÀßÄê¤·¤Þ¤·¤¿\n" ) ;
      break ;
    case 4: 
      printf( "Ï«Æ¯»²²Ã¿ÊÅ¸¥±¡¼¥¹ (³°¹ñ¿Í6.9Ëü¿Í) ¤ËÀßÄê¤·¤Þ¤·¤¿\n" ) ;
      break ;
    case 5: 
      printf( "Ï«Æ¯»²²ÃÁ²¿Ê¥±¡¼¥¹ (³°¹ñ¿Í6.9Ëü¿Í) ¤ËÀßÄê¤·¤Þ¤·¤¿\n" ) ;
      break ;
    case 6: 
      printf( "Ï«Æ¯»²²Ã¸½¾õ¥±¡¼¥¹ (³°¹ñ¿Í6.9Ëü¿Í) ¤ËÀßÄê¤·¤Þ¤·¤¿\n" ) ;
      break ;
    case 7: 
      printf( "Ï«Æ¯»²²Ã¿ÊÅ¸¥±¡¼¥¹ (³°¹ñ¿Í25Ëü¿Í) ¤ËÀßÄê¤·¤Þ¤·¤¿\n" ) ;
      break ;
    case 8: 
      printf( "Ï«Æ¯»²²ÃÁ²¿Ê¥±¡¼¥¹ (³°¹ñ¿Í25Ëü¿Í) ¤ËÀßÄê¤·¤Þ¤·¤¿\n" ) ;
      break ;
    case 9: 
      printf( "Ï«Æ¯»²²Ã¸½¾õ¥±¡¼¥¹ (³°¹ñ¿Í25Ëü¿Í) ¤ËÀßÄê¤·¤Þ¤·¤¿\n" ) ;
      break ;
    default :
      fprintf( stderr, "Ï«Æ¯ÎÏÎ¨¤ÎÀßÄê¤¬´Ö°ã¤Ã¤Æ¤¤¤Þ¤¹\n" ) ;
      exit(2) ;
  }
  ROUDYR = 2040 ;
}
